IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_host_nrf52.cpp
		case BLEAPP_SECEXCHG_DISPLAY:
			sec_param.io_caps  = BLE_GAP_IO_CAPS_DISPLAY_ONLY;
    			break;
		case (BLEAPP_SECEXCHG_KEYBOARD | BLEAPP_SECEXCHG_DISPLAY):
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
			break;
    }

    if (SecKeyExchg & BLEAPP_SECEXCHG_OOB)
    {
    	sec_param.oob = 1;
//    	nfc_ble_pair_init(&g_AdvInstance, NFC_PAIRING_MODE_JUST_WORKS);
    }

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);

    // Generate the ECDH key pair and set public key in the peer-manager.
    //err_code = ble_lesc_ecc_keypair_generate_and_set();
    //APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the Security Request timer timeout.
 *
 * @details This function will be called each time the Security Request timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void sec_req_timeout_handler(void * p_context)
{
    uint32_t err_code;

    if (s_BtHostData.ConnHdl != BLE_CONN_HANDLE_INVALID)
    {
        // Initiate bonding.
        //NRF_LOG_DEBUG("Start encryption\r\n");
        err_code = pm_conn_secure(s_BtHostData.ConnHdl, false);
        if (err_code != NRF_ERROR_INVALID_STATE)
        {
            APP_ERROR_CHECK(err_code);
        }
    }
}

bool BleAppAdvManDataSet(uint8_t *pAdvData, int AdvLen, uint8_t *pSrData, int SrLen)
{
	uint32_t err;

	if (pAdvData && AdvLen > 0)
	{
		int l = min(AdvLen, BLE_GAP_ADV_SET_DATA_SIZE_MAX);

		memcpy(s_BtHostData.ManufData.data.p_data, pAdvData, l);

		s_BtHostData.ManufData.data.size = l;
        g_AdvInstance.adv_data.adv_data.len = BLE_GAP_ADV_SET_DATA_SIZE_MAX;

        err = ble_advdata_encode(&s_BtHostData.AdvData, g_AdvInstance.adv_data.adv_data.p_data, &g_AdvInstance.adv_data.adv_data.len);
		APP_ERROR_CHECK(err);

	}

	if (pSrData && SrLen > 0)
	{
		int l = min(SrLen, BLE_GAP_ADV_SET_DATA_SIZE_MAX);

		memcpy(s_BtHostData.SRManufData.data.p_data, pSrData, l);

		s_BtHostData.SRManufData.data.size = l;
		g_AdvInstance.adv_data.scan_rsp_data.len = BLE_GAP_ADV_SET_DATA_SIZE_MAX;

		uint32_t err = ble_advdata_encode(&s_BtHostData.SrData, g_AdvInstance.adv_data.scan_rsp_data.p_data,
										 &g_AdvInstance.adv_data.scan_rsp_data.len);
		APP_ERROR_CHECK(err);
	}

	// SDK15 doesn't allow dynamically updating adv data.  Have to stop and re-start advertising
	if (s_BtHostData.bAdvertising == true)
	{
		sd_ble_gap_adv_stop(g_AdvInstance.adv_handle);
	}

	err = sd_ble_gap_adv_set_configure(&g_AdvInstance.adv_handle, &g_AdvInstance.adv_data, NULL);
//	APP_ERROR_CHECK(err);

	if (s_BtHostData.bAdvertising == true)
	{
		s_BtHostData.bAdvertising = false;
		BleAppAdvStart(BLEAPP_ADVMODE_FAST);
	}

#if 0
    int l = min(Len, BLE_GAP_ADV_MAX_SIZE);

    memcpy(g_AdvInstance.manuf_data_array, pData, l);
    uint32_t ret = ble_advdata_set(&(g_AdvInstance.advdata), &s_BtHostData.SRData);
#endif

    return s_BtHostData.bAdvertising;
}

void BleAppAdvStart(BLEAPP_ADVMODE AdvMode)
{
	if (s_BtHostData.bAdvertising == true || s_BtHostData.ConnHdl != BLE_CONN_HANDLE_INVALID)
		return;

	s_BtHostData.bAdvertising = true;

	if (s_BtHostData.AppMode == BLEAPP_MODE_NOCONNECT)
	{
		uint32_t err_code = sd_ble_gap_adv_start(g_AdvInstance.adv_handle, BLEAPP_CONN_CFG_TAG);
        APP_ERROR_CHECK(err_code);
	}
	else
	{
		uint32_t err_code = ble_advertising_start(&g_AdvInstance, (ble_adv_mode_t)AdvMode);
		if (err_code != NRF_SUCCESS)
		{
			 APP_ERROR_CHECK(err_code);
		}
	}
}

void BleAppAdvStop()
{
	sd_ble_gap_adv_stop(g_AdvInstance.adv_handle);
	s_BtHostData.bAdvertising = false;
}

/**@brief Overloadable function for initializing the Advertising functionality.
 */
__WEAK void BleAppAdvInit(const BleAppCfg_t *pCfg)
{
    uint32_t               err_code;
//    ble_advdata_manuf_data_t mdata;
    ble_advertising_init_t	initdata;

    memset(&initdata, 0, sizeof(ble_advertising_init_t));

    if (pCfg->pAdvManData != NULL)
    {
		s_BtHostData.ManufData.company_identifier = pCfg->VendorID;
		s_BtHostData.ManufData.data.p_data = (uint8_t*)pCfg->pAdvManData;
		s_BtHostData.ManufData.data.size = pCfg->AdvManDataLen;
    }
    if (pCfg->pSrManData != NULL)
    {
		s_BtHostData.SRManufData.company_identifier = pCfg->VendorID;
		s_BtHostData.SRManufData.data.p_data = (uint8_t*)pCfg->pSrManData;
		s_BtHostData.SRManufData.data.size = pCfg->SrManDataLen;
    }
    // Build advertising data struct to pass into @ref ble_advertising_init.

    initdata.advdata.include_appearance = false;

    if (pCfg->AdvTimeout != 0)
    {
        // ADV for a limited time, use this flag
        initdata.advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    }
    else
    {
        // Always ADV use this flag
        initdata.advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    }

    if (pCfg->pDevName != NULL)
    {
    	if (strlen(pCfg->pDevName) < 14)
    	{
    		initdata.advdata.name_type      = BLE_ADVDATA_SHORT_NAME;
    		initdata.advdata.short_name_len = strlen(pCfg->pDevName);
    	}
    	else
    		initdata.advdata.name_type = BLE_ADVDATA_FULL_NAME;
    }
    else
    {
    		initdata.advdata.name_type = BLE_ADVDATA_NO_NAME;
    }

    if (initdata.advdata.name_type == BLE_ADVDATA_NO_NAME)
    {
        if (pCfg->NbAdvUuid > 0 && pCfg->pAdvUuids != NULL)
        {
			if (pCfg->pAdvManData != NULL)
			{
				initdata.advdata.p_manuf_specific_data = &s_BtHostData.ManufData;
	        	initdata.srdata.uuids_complete.uuid_cnt = pCfg->NbAdvUuid;
	        	initdata.srdata.uuids_complete.p_uuids  = (ble_uuid_t*)pCfg->pAdvUuids;
			}
			else
			{
	        	initdata.advdata.uuids_complete.uuid_cnt = pCfg->NbAdvUuid;
	        	initdata.advdata.uuids_complete.p_uuids  = (ble_uuid_t*)pCfg->pAdvUuids;
				if (pCfg->pSrManData != NULL)
				{
		        	initdata.srdata.p_manuf_specific_data = &s_BtHostData.SRManufData;
				}
			}
        }
        else
        {
			if (pCfg->pAdvManData != NULL)
			{
				initdata.advdata.p_manuf_specific_data = &s_BtHostData.ManufData;
			}
			if (pCfg->pSrManData != NULL)
			{
	        	initdata.srdata.p_manuf_specific_data = &s_BtHostData.SRManufData;
			}
        }
    }
    else
    {
        if (pCfg->NbAdvUuid > 0 && pCfg->pAdvUuids != NULL)
        {
			initdata.srdata.uuids_complete.uuid_cnt = pCfg->NbAdvUuid;
			initdata.srdata.uuids_complete.p_uuids  = (ble_uuid_t*)pCfg->pAdvUuids;

			if (pCfg->pAdvManData != NULL)
			{
				initdata.advdata.p_manuf_specific_data = &s_BtHostData.ManufData;
			}

