IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_host_nrf52.cpp
		BleConnLedOff();
    }

    s_BtHostData.AppMode = pBleAppCfg->AppMode;
    s_BtHostData.ConnHdl = BLE_CONN_HANDLE_INVALID;

    if (pBleAppCfg->MaxMtu > NRF_BLE_MAX_MTU_SIZE)
		s_BtHostData.MaxMtu = pBleAppCfg->MaxMtu;
    else
    	s_BtHostData.MaxMtu = NRF_BLE_MAX_MTU_SIZE;

    app_timer_init();

    switch (s_BtHostData.AppMode)
    {
		case BLEAPP_MODE_LOOP:
		case BLEAPP_MODE_NOCONNECT:
			// app_timer_init();
			break;
		case BLEAPP_MODE_APPSCHED:
			// app_timer_init();
			APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
			break;
		case BLEAPP_MODE_RTOS:
			// RTOS hook-up has moved out of cfg storage. Apps using an RTOS
			// provide strong overrides of BtAppEvtWait/BtAppEvtNotify; no
			// per-mode storage is required here.
			break;
			default:
				;
    }

//    BtLescInit();

	err_code = nrf_sdh_enable((nrf_clock_lf_cfg_t *)&pBleAppCfg->ClkCfg);
    APP_ERROR_CHECK(err_code);

    // Initialize SoftDevice.
    BleAppStackInit(pBleAppCfg->PeriphDevMax, pBleAppCfg->CentralDevMax,
    				pBleAppCfg->AppMode != BLEAPP_MODE_NOCONNECT);

    //err_code = ble_lesc_init();
    //APP_ERROR_CHECK(err_code);

	if (pBleAppCfg->CentralDevMax > 0 && pBleAppCfg->AdvInterval > 0)
	{
		s_BtHostData.AppRole |= BLEAPP_ROLE_PERIPHERAL;

		if (pBleAppCfg->pDevName != NULL)
	    {
	        err_code = sd_ble_gap_device_name_set(&s_gap_conn_mode,
	                                          (const uint8_t *) pBleAppCfg->pDevName,
	                                          strlen(pBleAppCfg->pDevName));
	        APP_ERROR_CHECK(err_code);
	    }
	}

    if (pBleAppCfg->AppMode != BLEAPP_MODE_NOCONNECT)
    {
    	BleAppConnectable(pBleAppCfg, bEraseBond);
    }

    if (pBleAppCfg->PeriphDevMax > 0)
	{
		s_BtHostData.AppRole |= BLEAPP_ROLE_CENTRAL;
//		ret_code_t err_code = ble_db_discovery_init(BleAppDBDiscoveryHandler);
//		APP_ERROR_CHECK(err_code);
    }

    BleAppGattInit();

    BleAppInitUserData();

    BleAppPeerMngrInit(pBleAppCfg->SecType, pBleAppCfg->SecExchg, bEraseBond);

	if (pBleAppCfg->SecType != BLEAPP_SECTYPE_NONE)
	{
	    s_BtHostData.bSecure = true;
	}
	else
	{
	    s_BtHostData.bSecure = false;
	}

   // err_code = fds_register(fds_evt_handler);
   // APP_ERROR_CHECK(err_code);

    // Generate the ECDH key pair and set public key in the peer-manager.
    //err_code = ble_lesc_ecc_keypair_generate_and_set();
    //APP_ERROR_CHECK(err_code);

    if (s_BtHostData.AppRole & BLEAPP_ROLE_PERIPHERAL)
    {
        BleAppAdvInit(pBleAppCfg);

        err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, g_AdvInstance.adv_handle, GetValidTxPower(pBleAppCfg->TxPower));
        APP_ERROR_CHECK(err_code);
    }
    else
    {
        err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_SCAN_INIT, g_AdvInstance.adv_handle, GetValidTxPower(pBleAppCfg->TxPower));
        APP_ERROR_CHECK(err_code);
    }

#if (__FPU_USED == 1)
    // Patch for softdevice & FreeRTOS to sleep properly when FPU is in used
    NVIC_SetPriority(FPU_IRQn, APP_IRQ_PRIORITY_LOW);
    NVIC_ClearPendingIRQ(FPU_IRQn);
    NVIC_EnableIRQ(FPU_IRQn);
#endif


    return true;
}

void BleAppRun()
{
	s_BtHostData.bAdvertising = false;

	if ((s_BtHostData.AppRole & (BLEAPP_ROLE_PERIPHERAL | BLEAPP_ROLE_CENTRAL)) != BLEAPP_ROLE_CENTRAL)
	{
		BleAppAdvStart(BLEAPP_ADVMODE_FAST);
	}

    while (1)
    {
		if (s_BtHostData.AppMode == BLEAPP_MODE_RTOS)
		{
			BleAppRtosWaitEvt();
		}
		else
		{
			if (s_BtHostData.AppMode == BLEAPP_MODE_APPSCHED)
			{
				app_sched_execute();
			}
			BtLescRequestHandler();
			sd_app_evt_wait();
		}
    }

	/*	if (s_BtHostData.AppMode == BLEAPP_MODE_NOCONNECT)
		{
			uint32_t err_code = sd_ble_gap_adv_start(g_AdvInstance.adv_handle, BLEAPP_CONN_CFG_TAG);
			//uint32_t err_code = ble_advertising_start(&g_AdvInstance, BLE_ADV_MODE_FAST);
			APP_ERROR_CHECK(err_code);
		}
		else
		{
			if (s_BtHostData.AppRole & BLEAPP_ROLE_PERIPHERAL)
			{
				uint32_t err_code = ble_advertising_start(&g_AdvInstance, BLE_ADV_MODE_FAST);
				APP_ERROR_CHECK(err_code);
			}
		}
	*/
}


void BleTimerAppRun()
{
	s_BtHostData.bAdvertising = false;

	if ((s_BtHostData.AppRole & (BLEAPP_ROLE_PERIPHERAL | BLEAPP_ROLE_CENTRAL)) != BLEAPP_ROLE_CENTRAL)
	{
		BleAppAdvStart(BLEAPP_ADVMODE_FAST);
	}

    while (1)
    {
		if (s_BtHostData.AppMode == BLEAPP_MODE_RTOS)
		{
			BleAppRtosWaitEvt();
		}
		else
		{
			if (s_BtHostData.AppMode == BLEAPP_MODE_APPSCHED)
			{
				app_sched_execute();
			}
			BtLescRequestHandler();
			sd_app_evt_wait();
		}
    }

	/*	if (s_BtHostData.AppMode == BLEAPP_MODE_NOCONNECT)
		{
			uint32_t err_code = sd_ble_gap_adv_start(g_AdvInstance.adv_handle, BLEAPP_CONN_CFG_TAG);
			//uint32_t err_code = ble_advertising_start(&g_AdvInstance, BLE_ADV_MODE_FAST);
			APP_ERROR_CHECK(err_code);
		}
		else
		{
			if (s_BtHostData.AppRole & BLEAPP_ROLE_PERIPHERAL)
			{
				uint32_t err_code = ble_advertising_start(&g_AdvInstance, BLE_ADV_MODE_FAST);
				APP_ERROR_CHECK(err_code);
			}
		}
	*/
}


void BleAppScan()
{
	ret_code_t err_code;

	if (s_BtHostData.bScan == true)
	{
		err_code = sd_ble_gap_scan_start(NULL, &g_BleScanReportData);
	}
	else
	{
	    s_BtHostData.bScan = true;

		err_code = sd_ble_gap_scan_start(&s_BleScanParams, &g_BleScanReportData);
	}
	APP_ERROR_CHECK(err_code);
}

void BleAppScanStop()
{
	if (s_BtHostData.bScan == true)
	{
		ret_code_t err_code = sd_ble_gap_scan_stop();
		APP_ERROR_CHECK(err_code);
		s_BtHostData.bScan = false;
	}
}

bool BleAppScanInit(BleAppScanCfg_t *pCfg)
{
	if (pCfg == NULL)
	{
		return false;
	}

	s_BleScanParams.timeout = pCfg->Timeout;
	s_BleScanParams.window = pCfg->Duration;
	s_BleScanParams.interval = pCfg->Interval;

    uint8_t uidtype = BLE_UUID_TYPE_VENDOR_BEGIN;

    ret_code_t err_code = sd_ble_uuid_vs_add(&pCfg->BaseUid, &uidtype);
    APP_ERROR_CHECK(err_code);

    s_BtHostData.bScan = true;

	err_code = sd_ble_gap_scan_start(&s_BleScanParams, &g_BleScanReportData);
	APP_ERROR_CHECK(err_code);

	return err_code == NRF_SUCCESS;
}

bool BleAppScanInit(ble_uuid128_t * const pBaseUid, ble_uuid_t * const pServUid)
{
    ble_uuid128_t base_uid = *pBaseUid;
    uint8_t uidtype = BLE_UUID_TYPE_VENDOR_BEGIN;

    ret_code_t err_code = sd_ble_uuid_vs_add(&base_uid, &uidtype);
    APP_ERROR_CHECK(err_code);

